benches/benchmark_cached.yml
config:
  target: "http://127.0.0.1:8000"
  phases:
    # - duration: 10
    #   arrivalRate: 50
    #   name: Warm up
    # - duration: 60
    #   arrivalRate: 50
    #   rampTo: 500
    #   name: Ramp up load
    - duration: 600
      arrivalRate: 500
      name: Sustained load
  ensure:
    p95: 1000

scenarios:
  - name: "convert words english"
    flow:
      - post:
          url: "/api/convert"
          headers:
            auth: eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJleHAiOjE2NDQzOTA2NzEsImlhdCI6MTY0MTc5ODY3MSwic3ViIjoxfQ.nhtuA5-8gerR_PcevfLmqVQUyUrD-DutJmxKTg5n4wc
          content-type: "application/json"
          json:
            word: "Queen"
            lang: "en"
            speed: 1.0
            fmt: "wav"