benches/benchmark_cached_convert.yml
config:
  target: "http://127.0.0.1:8000"
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up
    - duration: 60
      arrivalRate: 10
      rampTo: 90
      name: Ramp up load
    - duration: 600
      arrivalRate: 90
      name: Sustained load

scenarios:
  - name: "convert words english"
    flow:
      - post:
          url: "/api/convert"
          content-type: "application/json"
          json:
            word: "Queen"
            lang: "en"
            speed: 1.5
            fmt: "mp3"