benches/benchmark_realistic.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 600
      arrivalRate: 200
      name: Sustained load
  http:
    timeout: 10
    pool: 20
  payload:
  -
    path: "wordlist.csv"
    fields:
      - "keyword"
  -
    path: "wordlist.csv"
    fields:
      - "keyword2"

scenarios:
  - name: "generate new word"
    flow:
      - post:
          url: "/api/convert"
          content-type: "application/json"
          json:
            word: "{{ keyword }} {{ keyword2 }}"
            lang: "en"
            speed: 1.0
            fmt: "wav"
    weight: 2
  - name: "generate new word and convert"
    flow:
      - post:
          url: "/api/convert"
          headers:
          content-type: "application/json"
          json:
            word: "{{ keyword }} {{ keyword2 }}"
            lang: "en"
            speed: 1.0
            fmt: "mp3"
    weight: 2
  - name: "get cached word"
    flow:
      - post:
          url: "/api/convert"
          content-type: "application/json"
          json:
            word: "some word"
            lang: "en"
            speed: 1.0
            fmt: "wav"
    weight: 10
  - name: "get cached word convert"
    flow:
      - post:
          url: "/api/convert"
          content-type: "application/json"
          json:
            word: "some word"
            lang: "en"
            speed: 1.5
            fmt: "wav"
    weight: 10